# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = int(input("введите трехзначное число: "))
b = a%10
c = a//10
d = int(c%10)
e = int(a//100)
print(b+d+e)

